core/app/Http/Controllers/PaymentController.php

    public function __construct()
    {
        $this->template = GeneralSetting::first()->theme == 1 ? 'frontend.' : 'theme2.';
---
select * from `general_settings` limit 1