core/app/Http/Controllers/SiteController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $this->template = GeneralSetting::first()->theme == 1 ? 'frontend.' : 'theme2.';

select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1
---
    public function index()
    {
        $pageTitle = 'Home';

        $sections = Page::where('name', 'home')->first();

        if (!$sections) {

            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();

select * from `pages` where `slug` = 'about' limit 1
---
    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();

select * from `section_data` where `key` = 'service.element' and json_contains(`data`, '\"web\"', '$."slug"') limit 1
---
    public function service($slug)
    {

        $pageTitle = "Our Service";
        $data = SectionData::where('key', 'service.element')->whereJsonContains('data->slug', $slug)->first();

select * from `plans` where `status` = 1
---
    public function allInvestmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();