core/app/Http/Controllers/Admin/GeneralSettingController.php

select * from `general_settings` limit 1
---
    public function index()
    {
        $data['pageTitle'] = 'General Setting';
        $data['navGeneralSettingsActiveClass'] = 'active';
        $data['subNavGeneralSettingsActiveClass'] = 'active';
        $data['general'] = GeneralSetting::first();

select * from `general_settings` limit 1
---
    public function generalSettingUpdate(Request $request)
    {

        $general = GeneralSetting::first();

select * from `general_settings` limit 1
---
            'user_reg' => $request->user_reg == 'on' ? 1 : 0,
            'is_email_verification_on' => $request->is_email_verification_on == 'on' ? 1 : 0,
            'is_sms_verification_on' => $request->is_sms_verification_on == 'on' ? 1 : 0,
            'logo' => isset($logo) ? ($logo ?? '') : GeneralSetting::first()->logo,
            'favicon' => isset($icon) ? ($icon ?? '') : GeneralSetting::first()->favicon,
            'login_image' => isset($login_image) ? ($login_image ?? '') : GeneralSetting::first()->login_image,
            'primary_color' =>  $request->primary_color ?? '',
            'copyright' => $request->copyright,
            'map_link' => $request->map_link,
            'frontend_login_image' => isset($frontend_login_image) ? ($frontend_login_image ?? '') : GeneralSetting::first()->frontend_login_image,
            'breadcrumbs' => isset($breadcrumbs) ? ($breadcrumbs ?? '') : GeneralSetting::first()->breadcrumbs,
            'frontend_main_background_image' => isset($main) ? ($main ?? '') : GeneralSetting::first()->frontend_main_background_image,

select * from `general_settings` limit 1
---
    public function seoManage()
    {
        $data['pageTitle'] = 'Manage SEO';
        $data['navGeneralSettingsActiveClass'] = 'active';
        $data['subNavSEOManagerActiveClass'] = 'active';
        $data['seo'] = GeneralSetting::first();

select * from `general_settings` limit 1
update `general_settings` set `seo_description` = 'Discover a secure and profitable trading platform with Blame Trading Management. We offer expert-managed investments, real-time market insights, automated earnings, and instant withdrawals. Trade with confidence on a registered and verified platform designed for success.\"', `general_settings`.`updated_at` = '2025-02-28 03:46:37' where `id` = 1
---
    public function seoManageUpdate(Request $request)
    {

        $general = GeneralSetting::first();

        $data = $request->validate([
            'seo_description' => 'required',
        ]);

        $general->update($data);

select * from `general_settings` limit 1
update `general_settings` set `theme` = '1', `general_settings`.`updated_at` = '2025-02-28 03:25:09' where `id` = 1
---
    public function themeUpdate($name)
    {
        $general = GeneralSetting::first();

        $general->theme = $name;

        $general->save();