core/app/Http/Controllers/Admin/HomeController.php

    public function dashboard()
    {
        $data['pageTitle'] = 'Dashboard';
        $data['navDashboardActiveClass'] = "active";

        $data['totalPayments'] = Payment::where('payment_status', 1)->sum('final_amount');
        $data['totalPendingPayments'] = Payment::where('payment_status', 0)->sum('final_amount');
        $data['totalWithdraw'] = Withdraw::where('status', 1)->sum('withdraw_amount');

        $data['totalUser'] = User::count();

        $data['activeUser'] = User::where('status', 1)->count();

        $data['deActiveUser'] = User::where('status', 0)->count();

        $months = collect([]);
        $totalAmount = collect([]);
        $data['users'] = User::latest()->paginate(5);
        Payment::where('payment_status', 1)
            ->select(DB::raw('SUM(final_amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get()
            ->map(function ($q) use ($months, $totalAmount) {
                $months->push($q->month);
                $totalAmount->push($q->total);
            });
---
select sum(`final_amount`) as aggregate from `payments` where `payment_status` = 1
select sum(`final_amount`) as aggregate from `payments` where `payment_status` = 0
select sum(`withdraw_amount`) as aggregate from `withdraws` where `status` = 1
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
select * from `users` order by `created_at` desc limit 5 offset 0
select SUM(final_amount) as total, MONTHNAME(created_at) month from `payments` where `payment_status` = 1 group by `month`


        $withdrawMonths = collect([]);
        $withdrawTotalAmount = collect([]);
        Withdraw::where('status', 1)
            ->select(DB::raw('SUM(withdraw_amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get()
            ->map(function ($q) use ($withdrawMonths, $withdrawTotalAmount) {
                $withdrawMonths->push($q->month);
                $withdrawTotalAmount->push($q->total);
            });

        $data['withdrawMonths'] = $withdrawMonths;
        $data['withdrawTotalAmount'] = $withdrawTotalAmount;
        $data['totalGateways'] = Gateway::where('gateway_name', '!=', 'bank')->count();
        $data['totalWithdrawCharge'] = Withdraw::where('status', 1)->sum('withdraw_charge');
        $data['totalWithdrawGateways'] = WithdrawGateway::where('status', 1)->count();
        $data['totalInterest'] = Payment::where('payment_status', 1)->sum('interest_amount');
        $data['pendignWithdraw'] = Withdraw::where('status', 0)->sum('withdraw_amount');
---
select SUM(withdraw_amount) as total, MONTHNAME(created_at) month from `withdraws` where `status` = 1 group by `month`
select count(*) as aggregate from `gateways` where `gateway_name` != 'bank'
select sum(`withdraw_charge`) as aggregate from `withdraws` where `status` = 1
select count(*) as aggregate from `withdraw_gateways` where `status` = 1
select sum(`interest_amount`) as aggregate from `payments` where `payment_status` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `status` = 0